package com.travelzen.framework.core.common;

/**
 * 返回码列表
 * 返回码总长设为六位，前两位用两个英文字母表示模块，后面四个使用数字
 */
public enum ReturnCode {
	SUCCESS("SUCCESS", null),
	ERROR("ERROR", "ERROR"),

	// 真旅项目
	TP0001("TP0001", "您还不是白名单客户"),
	TP0002("TP0002", "真旅评审结果未通过"),
	TP0003("TP0003", "您与真旅网合作期限小于%s个月"),
	TP0004("TP0004", "您的下游回款账期必须是无账期"),
	TP0005("TP0005", "您的下游客户类型不是企业"),
	TP0006("TP0006", "您在真旅网系统中最近三个月逾期率大于%s"),
	TP0007("TP0007", "您在真旅网系统中最近一个月逾期次数大于%s"),
	TP0008("TP0008", "您的订单采购增长率小于%s"),
	TP0009("TP0009", "您的工商信息不真实"),
	TP0010("TP0010", "法院被执行（企业）总金额大于%s元"),
	TP0011("TP0011", "法院被执行（企业）总次数大于%s"),
	TP0012("TP0012", "法院被执行（个人）总金额大于%s元"),
	TP0013("TP0013", "法院被执行（个人）总次数大于%s"),
	TP0014("TP0014", "您存在负面信息"),
	TP0015("TP0015", "%s"),
	//客户申请审核
	TP1000("TP1000","服务器处理异常"),
	TP1100("TP1100","申请日期不能为空"),
	TP1101("TP1101","申请额度的公司Id不能为空"),
	TP1102("TP1102","申请公司的全称不能为空"),
	TP1103("TP1103","实际控制人不能为空"),
	TP1104("TP1104","申请额度不能为空"),
	TP1105("TP1105","申请类型不能为空"),
	TP1106("TP1106","企业性质不能为空"),
	TP1107("TP1107","是否为上市公司不能为空"),
	TP1108("TP1108","主要合作产品不能为空"),
	TP1109("TP1109","是否为淡旺季不能为空"),
	TP1110("TP1110","经营模式不能为空"),
	TP1111("TP1111","资质信息不能为空"),
	TP1112("TP1112","组织机构代码不能为空"),
	TP1113("TP1113","营业执照代码不能为空"),
	TP1114("TP1114","税务登记证代码不能为空"),
	TP1115("TP1115","当地同等地位类型不能为空"),
	TP1116("TP1116","同类型采购商地位字段不能为空"),
	TP1117("TP1117","合作配合度不能为空"),
	TP1118("TP1118","借款期内中断可能性不能为空"),
	TP1119("TP1119","借款期内增加采购商可能性不能为空"),
	TP1120("TP1120","联系人姓名不能为空"),
	TP1121("TP1121","手机号码不能为空"),
	TP1122("TP1122","电子邮箱不能为空"),
	TP1123("TP1123","建议额度不能为空"),
	TP1124("TP1124","建议审核结果不能为空"),
	TP1125("TP1125","下游客户类型不能为空"),
	TP1126("TP1126","该客户已存在,待准入审核"),
	TP1127("TP1127","该客户已存在,待人工审核"),
	TP1128("TP1128","该客户未通过审核，申请时间间隔未超过三个月"),
	TP1129("TP1129","该客户已存在,已通过审核"),
	
	// 额度生效反馈
	TP2000("TP2000", "合同未收到"),
	TP2001("TP2001", "合同有误"),
	
	// 授信额度相关
	TP3001("TP3001", "机构不能为空"),
	TP3002("TP3002", "客户ID无效"),
	TP3003("TP3003", "交易编号不能为空"),
	TP3004("TP3004", "金额不正确"),
	TP3005("TP3005", "通知URL不能为空"),
	TP3006("TP3006", "签名不正确"),
	TP3007("TP3007", "交易时间不能为空"),
	TP3008("TP3008", "客户名称不能为空"),
	TP3009("TP3009", "订单信息不能为空"),
	TP3010("TP3010", "原支付交易号不能为空"),
	TP3011("TP3011", "交易类型不能为空"),
	TP3012("TP3012", "授信额度不存在"),
	TP3013("TP3013", "授信余额不足"),
	TP3014("TP3014", "授信额度异常"),
	TP3015("TP3015", "授信额度状态异常"),
	TP3016("TP3016", "Cana用户不存在"),
	TP3017("TP3017", "验签异常"),
	TP3018("TP3018", "无法查到原交易信息"),
	TP3019("TP3019", "原交易订单不是支付订单"),
	TP3020("TP3020", "已经存在该交易记录"),
	TP3021("TP3021", "退款金额大于剩余可退款金额"),
	TP3022("TP3022", "签名失败")
	;

	private String retCode;
	private String retMsg;

	ReturnCode(String code, String retMsg) {
	    this.retCode = code;
		this.retMsg = retMsg;
	}

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public String getRetMsg() {
        return retMsg;
    }

    public void setRetMsg(String retMsg) {
        this.retMsg = retMsg;
    }
}
